#pragma once
#include <vector>

std::vector<std::string> censoredOriginal = {
	"аспид", "баран", "боров", "быдло", "волк позорный", "горилла", "душной козел", "козлина", "та ещё жучка", "змея", "змей", "подколодный",
	"гадюка", "гюрза", "козья морда", "коза драная", "кобызиться", "кобыла", "конь педальный", "корова", "крыса", "мартышка", "кривляка", "осёл",
	"олень", "тупорылый", "пёс", "пустобрех", "брехун", "врун", "сиволапый", "сивый мерин", "свинья", "сукин сын", "хорёк", "шавка", "щенок",
	"напыщенный индюк", "безмозглая курица", "гусыня", "павлин", "сыч", "дятел", "щегол", "вобла сушеная", "каракатица", "вошь на гребешке",
	"вшивота", "глиста ходячая", "гнида", "жук навозный", "мандавошка", "лобковая вошь", "моль", "назойливая муха", "ночная бабочка", "трутень",
	"пьявка", "приставучий репей", "лопух", "осиновый лист", "заячий хвост", "поганка", "шут гороховый", "дерево", "клубничка", "банный лист",
	"лох", "лохушка", "дубина стоеросовая", "орясина", "балбес", "оболтус", "бестия", "барыга", "брехун", "вонючка", "ворюга", "говно", "говнюк",
	"гнусь", "грубиян", "дегенерат", "дерьмо", "дрянь", "дурак", "дурачок", "дуремар", "зюзя", "залупа", "конявый", "кривляка", "кандибобер",
	"лапотник", "лярва", "мегера", "мразь", "мозгляк", "замухрышка", "мудак", "мудозвон", "нахал", "наглец", "недотепа", "обалдуй", "невежа",
	"болван", "пакостник", "паскуда", "пердун", "проститутка", "подлец", "пижон", "пидор", "позорный", "погань", "потаскуха", "профура", "профурсетка",
	"прошмандовка", "рвань", "рванина", "негодяй", "мерзавец", "раззява", "расшивоха", "рогоносец", "сволочь", "старая перечница", "стервец",
	"стиляга", "скряга", "жмот", "стерва", "тварь", "животное", "трепло", "пустомеля", "тупица", "тупой", "ублюдок", "выродок", "незаконнорожденный",
	"урка", "уркаган", "хулиган", "преступник", "шулер", "филькина грамота", "финтифлюшка", "фраер", "фуфло", "хабалка", "халявщик", "дармоед",
	"хам", "хапуга", "хер", "хмырь", "холуй", "чучело", "пугало", "шалава", "шантрапа", "швабра", "шелупонь", "шельма", "шибздик", "шкура", "шлюха",
	"шмара", "шмаравоз", "шпана", "шушера", "гандон", "дистрофик", "желчный", "шизик", "псих", "язва", "алкаш", "алик", "алконавт", "выпивоха",
	"пропойца", "пьянь", "забулдыга", "пьяница", "бузотер", "бухло", "залить зенки", "квасить", "пропойца", "ханыга", "стеллерова газель", "халтома",
	"кощей", "кикимора", "карга", "леший", "лахудра", "лахушка", "морда", "мордоворот", "мурло", "моська", "образина", "рыло", "страхолюдина", "урод",
	"харя", "чувырла", "шибздик", "шмакодявка", "задрот", "сексот", "солдафон", "стукач", "тормоз", "бездарь", "бездельник", "безумец", "безобразник",
	"безмозглый", "бестолочь", "бесстыжий", "беспутный", "засранец", "заморыш", "зануда", "залупа", "недоделок", "недотёпа", "недоносок", "невежа",
	"невежда", "неуч", "неряха", "непутевый", "развратник", "разгильдяй", "размазня", "разиня", "раздолбай", "раззява", "растяпа", "расхлябанность",
	"придурок", "прихлебатель", "прихвостень", "приблуда", "подхалим", "подлиза", "подкаблучник", "подзаборный", "пройдоха", "прохвост", "прохиндей", "проныра"
};

std::vector<std::string> censoredOriginalAdvanced = {
	"корявый", "аморальный", "облезлый", "омерзительный", "тупой", "тупорылый",
	"мягкотелый", "безмозглый", "дурной", "вонючий", "вшивый", "хитрожопый"
};